// 匹配双引号（全局匹配）
// export const DOUBLE_QUOTA_PATTERN = /\\"/g
export const DOUBLE_QUOTA_PATTERN = /[^"]+(?=")/g
export const IntReg = /^[+]{0,1}(\d+)$/ // 正整数
export const IntRegLen11 = /(^[1-9]\d{0,10}$)|(^0$)/ // 0-11位的正整数和0
export const IntRegLen18 = /(^[1-9]\d{0,17}$)|(^0$)/ // 0-18位的正整数和0
export const IntRegLen3 = /(^[1-9]\d{0,2}$)|(^0$)/ // 0-3位的正整数和0
export const IntRegLen4 = /(^[1-9]\d{0,3}$)|(^0$)/ // 0-4位的正整数和0
export const IntRegLen5 = /(^[1-9]\d{0,4}$)|(^0$)/ // 0-5位的正整数和0
export const IntRegLen6 = /(^[1-9]\d{0,5}$)|(^0$)/ // 0-6位的正整数和0
export const IntRegLen8 = /(^[1-9]\d{0,7}$)|(^0$)/ // 0-8位的正整数和0
export const IntRegLen10 = /(^[1-9]\d{0,9}$)|(^0$)/ // 0-10位的正整数和0
export const MONEY_CHECK = /^[0-9]\d{0,6}(\.\d{1,2})?$|^0(\.\d{1,2})?$/ // 金额：整数不超过7位，小数不超过2位
export const Decimal8 = /^[0-9]\d{0,5}(\.\d{1,2})?$|^0(\.\d{1,2})?$/ // 整数不超过6位，小数不超过2位，总长度8
export const MOBILE_PHONE_REG = /^(1[3456789]\d{9})$/ // 移动电话
export const FIXED_PHONE_REG = /^(\(\d{3,4}\)|\d{3,4}-|\s)?\d{7,14}$/ // 固定电话
export const PHONE_REG = /(^(1[3456789]\d{9})$)|(^(\(\d{3,4}\)|\d{3,4}-|\s)?\d{7,14}$)/ // 固定电话 + 移动电话
export const Decimal12 = /(^[1-9]\d{0,3})+(\.\d{1,8})?$/ // 整数0-4位，小数点有0-8位，总长度12
export const IP_REG = /(?=(\b|\D))(((\d{1,2})|(1\d{1,2})|(2[0-4]\d)|(25[0-5]))\.){3}((\d{1,2})|(1\d{1,2})|(2[0-4]\d)|(25[0-5]))(?=(\b|\D))/ // IPv4地址
export const PORT_REG = /^([0-9]|[1-9]\d{1,3}|[1-5]\d{4}|6[0-4]\d{4}|65[0-4]\d{2}|655[0-2]\d|6553[0-5])$/ // 端口号
export const CARD_NO = /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/ // 身份证号码
export const HPHM_REG = /^(([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-Z](([0-9]{5}[DF])|([DF]([A-HJ-NP-Z0-9])[0-9]{4})))|([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-Z][A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳使领])|([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-Z](([0-9]{6}[DF])|([DF]([A-HJ-NP-Z0-9])[0-9]{5})))|([京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-Z][A-HJ-NP-Z0-9]{5}[A-HJ-NP-Z0-9挂学警港澳使领]))$/ // 号牌号码验证
export const BANK_ACCOUNT = /^([1-9]{1})(\d{11}|\d{15}|\d{16}|\d{17}|\d{18})$/ // 银行卡号，银行卡号有以下情况建行16、19，农行19，工行19、交通17、民生16、兴业18、招行12、16、19
